ЕРПУХАстенд.cbr_Основной/src/Catalogs/РесурсныеСпецификации/РесурсныеСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ee5a63d2-90be-4f36-8a88-5415230abebc">
  <name>РесурсныеСпецификации</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="c0db759b-cb86-470f-ac1a-4622007748c9">
    <name>КонецДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="27f7b7ba-b394-47b5-89a1-f5441072f5d4">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="436cac62-4694-43a2-8d22-669228b1baf1">
    <name>ОсновноеИзделиеКоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>cbr_Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Действия</name>
    <comment>// Османов Н.М. 21.11.2023 ЧТЗ №Действия в производстве</comment>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.ЭтапыПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Стадия</name>
      <type>
        <types>CatalogRef.СтадииЗагрузки</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияПроизводства</types>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Температура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Давление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкоростьВращения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="f3f60468-b96f-4528-8adc-5b0b567a3e3d">
    <name>МатериалыИУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c760a5ad-a536-49ec-816d-fad0d87140f3">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

ЕРПУХАстенд.cbr_Основной/src/InformationRegisters/НормыТехнологическихПотерьИВремениИзготовления/НормыТехнологическихПотерьИВремениИзготовления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыТехнологическихПотерьИВремениИзготовления</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НормаТехнологическихПотерь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаВремениИзготовления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ГруппаНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МинимальныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МаксимальныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЕРПУХАстенд.cbr_Основной/src/Catalogs/РесурсныеСпецификации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&После("РассчитатьКоличество")
Процедура П3_РассчитатьКоличество(ПартияВыпуска, Коллекция, ЕстьУпаковки, ЕстьВероятность, Округлить, КонтрольОкругленияВверх, РассчитатьФормулы, ДанныеДляРасчета)
	
	Если ЕстьВероятность Тогда // пока что эта переменная указывает, что в Коллекции находятся МатериалыУслуги
		
		НастройкаРассчета = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ДокументЭтап2_2", "ОбработкаФормированиеЭтапа", 0); 
		Если Не НастройкаРассчета = 1 Тогда
			Возврат;
		КонецЕсли;
		
		// 0 - установка признака, что не нужно рассчитывать нормы техпотерь
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ДокументЭтап2_2", "ОбработкаФормированиеЭтапа", 0);
		
		РодительИзделия = Неопределено;
		ВидНоменклатурыИзделия = Неопределено;
		Если Коллекция.Количество() > 0 Тогда
			Если ЗначениеЗаполнено(Коллекция[0].Этап) Тогда
				Если ЗначениеЗаполнено(Коллекция[0].Этап.Владелец) Тогда
					ЗначенияРеквизитовИзделия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Коллекция[0].Этап,
																						   "Владелец.ОсновноеИзделиеНоменклатура,
																						   |Владелец.ОсновноеИзделиеНоменклатура.ВидНоменклатуры,
																						   |Владелец.ОсновноеИзделиеНоменклатура.Родитель,
																						   |Владелец.ОсновноеИзделиеВидНоменклатуры");
					
					РодительИзделия = ЗначенияРеквизитовИзделия.ВладелецОсновноеИзделиеНоменклатураРодитель;
					ВидНоменклатурыИзделия = ЗначенияРеквизитовИзделия.ВладелецОсновноеИзделиеВидНоменклатуры;
					Если Не ЗначениеЗаполнено(ЗначенияРеквизитовИзделия.ВладелецОсновноеИзделиеВидНоменклатуры) Тогда
						ВидНоменклатурыИзделия = ЗначенияРеквизитовИзделия.ВладелецОсновноеИзделиеНоменклатураВидНоменклатуры;
					КонецЕсли;

				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ЭтоПолуфабрикат = Ложь;
		Если ЗначениеЗаполнено(ВидНоменклатурыИзделия) Тогда
			ЭтоПолуфабрикат = УправлениеСвойствами.ЗначениеСвойства(ВидНоменклатурыИзделия, "ЭтоПолуфабрикатВидНоменклатуры");
		КонецЕсли;
		
		КоличествоИзделия = 0;		
		Если ПартияВыпуска.Свойство("Расшифровка") Тогда
			Если ТипЗнч(ПартияВыпуска.Расшифровка) = Тип("Массив") И ПартияВыпуска.Расшифровка.Количество() > 0 Тогда
				КоличествоИзделия = ПартияВыпуска.Расшифровка[0].Числитель;
			Иначе
				КоличествоИзделия = ПартияВыпуска.Числитель;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РодительИзделия) Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			
			Запрос = Новый Запрос;			
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НормыТехнологическихПотерьИВремениИзготовленияСрезПоследних.НормаТехнологическихПотерь КАК НормаТехнологическихПотерь
			|ИЗ
			|	РегистрСведений.НормыТехнологическихПотерьИВремениИзготовления.СрезПоследних(, ГруппаНоменклатуры = &РодительИзделия) КАК НормыТехнологическихПотерьИВремениИзготовленияСрезПоследних
			|ГДЕ
			|	НормыТехнологическихПотерьИВремениИзготовленияСрезПоследних.МинимальныйОбъем <= &Количество
			|	И ВЫБОР
			|			КОГДА НормыТехнологическихПотерьИВремениИзготовленияСрезПоследних.МаксимальныйОбъем = 0
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ НормыТехнологическихПотерьИВремениИзготовленияСрезПоследних.МаксимальныйОбъем > &Количество
			|		КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	НормыТехнологическихПотерьИВремениИзготовленияСрезПоследних.Период УБЫВ";
			
			Запрос.УстановитьПараметр("Количество", КоличествоИзделия);
			Запрос.УстановитьПараметр("РодительИзделия", РодительИзделия);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				
				Если ЭтоПолуфабрикат = Истина Тогда
					Возврат;
				КонецЕсли;
					
				Для Каждого СтрокаКоллекции Из Коллекция Цикл
					
					ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоллекции.Номенклатура, "ВидНоменклатуры");
					ЭтоПолуфабрикатОбеспечения = УправлениеСвойствами.ЗначениеСвойства(ВидНоменклатуры, "ЭтоПолуфабрикатВидНоменклатуры");
					Если ЭтоПолуфабрикатОбеспечения = Истина Тогда
						Продолжить;
					КонецЕсли;
					
					ЦелоеКоличествоУпаковок = Цел(СтрокаКоллекции.КоличествоУпаковок);
					Если ЦелоеКоличествоУпаковок = СтрокаКоллекции.КоличествоУпаковок Тогда
						Продолжить;
					КонецЕсли;
					
					Если Не СтрокаКоллекции.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоллекции.Номенклатура, "ЕдиницаИзмерения") Тогда
						Продолжить;
					КонецЕсли;
					
					ЦелоеКоличествоУпаковок = ЦелоеКоличествоУпаковок + 1;
					СтрокаКоллекции.КоличествоУпаковок = ЦелоеКоличествоУпаковок;
					СтрокаКоллекции.Количество = ЦелоеКоличествоУпаковок;
					
				КонецЦикла;
				
				Возврат;
				
			КонецЕсли;
			
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			НормаТехнологическихПотерь = Выборка.НормаТехнологическихПотерь;
			
			Если Не ЗначениеЗаполнено(НормаТехнологическихПотерь) Тогда
				
				Если ЭтоПолуфабрикат = Истина Тогда
					Возврат;
				КонецЕсли;
				
				Для Каждого СтрокаКоллекции Из Коллекция Цикл
					
					ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоллекции.Номенклатура, "ВидНоменклатуры");
					ЭтоПолуфабрикатОбеспечения = УправлениеСвойствами.ЗначениеСвойства(ВидНоменклатуры, "ЭтоПолуфабрикатВидНоменклатуры");
					Если ЭтоПолуфабрикатОбеспечения = Истина Тогда
						Продолжить;
					КонецЕсли;
					
					ЦелоеКоличествоУпаковок = Цел(СтрокаКоллекции.КоличествоУпаковок);
					Если ЦелоеКоличествоУпаковок = СтрокаКоллекции.КоличествоУпаковок Тогда
						Продолжить;
					КонецЕсли;
					
					Если Не СтрокаКоллекции.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоллекции.Номенклатура, "ЕдиницаИзмерения") Тогда
						Продолжить;
					КонецЕсли;
					
					ЦелоеКоличествоУпаковок = ЦелоеКоличествоУпаковок + 1;
					СтрокаКоллекции.КоличествоУпаковок = ЦелоеКоличествоУпаковок;
					СтрокаКоллекции.Количество = ЦелоеКоличествоУпаковок;
					
				КонецЦикла;
				
				Возврат;
				
			КонецЕсли;
			
			Для Каждого СтрокаКоллекции Из Коллекция Цикл
								
				СтрокаКоллекции.Количество = СтрокаКоллекции.Количество  * (1 + НормаТехнологическихПотерь / 100);
				СтрокаКоллекции.КоличествоУпаковок = СтрокаКоллекции.КоличествоУпаковок  * (1 + НормаТехнологическихПотерь / 100);
				
				Если ЭтоПолуфабрикат = Истина Тогда
					Продолжить;
				КонецЕсли;
				
				ВидНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоллекции.Номенклатура, "ВидНоменклатуры");
				ЭтоПолуфабрикатОбеспечения = УправлениеСвойствами.ЗначениеСвойства(ВидНоменклатуры, "ЭтоПолуфабрикатВидНоменклатуры");
				Если ЭтоПолуфабрикатОбеспечения = Истина Тогда
					Продолжить;
				КонецЕсли;
				
				ЦелоеКоличествоУпаковок = Цел(СтрокаКоллекции.КоличествоУпаковок);
				Если ЦелоеКоличествоУпаковок = СтрокаКоллекции.КоличествоУпаковок Тогда
					Продолжить;
				КонецЕсли;
				
				Если Не СтрокаКоллекции.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКоллекции.Номенклатура, "ЕдиницаИзмерения") Тогда
					Продолжить;
				КонецЕсли;
				
				ЦелоеКоличествоУпаковок = ЦелоеКоличествоУпаковок + 1;
				СтрокаКоллекции.КоличествоУпаковок = ЦелоеКоличествоУпаковок;
				СтрокаКоллекции.Количество = ЦелоеКоличествоУпаковок;
				
			КонецЦикла;
			
			ТекстСообщения = НСтр("ru = 'Применена норма технологических потерь, равная %1'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, НормаТехнологическихПотерь);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПолученияПредставления")
Процедура П3_ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ЕстьЗапрет = РаботаСПроизводствомСервер.УстановленЗапретОткрытияСпецификации(Данные.Ссылка);
	
	Если ЕстьЗапрет Тогда
		
		СтандартнаяОбработка = Ложь;
		Представление = "Запрещено к просмотру";
		
	КонецЕсли;
	
КонецПроцедуры

Функция АктивнаяСпецификация(Объект) Экспорт
	
	РезультатФункции = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсныеСпецификации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|ГДЕ
		|	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура = &ОсновноеИзделиеНоменклатура
		|	И РесурсныеСпецификации.ОсновноеИзделиеХарактеристика = &ОсновноеИзделиеХарактеристика
		|	И РесурсныеСпецификации.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
		|	И РесурсныеСпецификации.cbr_Активность
		|	И НЕ РесурсныеСпецификации.Ссылка = &Ссылка
		|	И НЕ РесурсныеСпецификации.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ОсновноеИзделиеНоменклатура", Объект.ОсновноеИзделиеНоменклатура);
	Запрос.УстановитьПараметр("ОсновноеИзделиеХарактеристика", Объект.ОсновноеИзделиеХарактеристика);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		РезультатФункции = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат РезультатФункции; 
	
КонецФункции

#КонецОбласти

#КонецЕсли
